#include <cstdio>
#include <cstring>
#include <iostream>
#include <string>
#include <ctime>
#include "Node.hpp"
using namespace std;

time_t now;
const int str_max = 100+10;
void menu_admin();
void menu_stu();
int menu_login();
void modify_admin();

int main() {
	system("color 9e");//颜色设置
	NODE pHead;
	int State = 0;
	int select = 0;
	State = menu_login();
	if(State == 1) {
		while(true) {
			cout << "=========================管理员模式============================================\n\n";
			menu_admin();
			cin>>select;
			cout << "===============================================================================\n\n";
			//system("cls");
			if(select == 0) {
				break;
			}
			switch (select)
			{
				case 1://输入学生信息
				{
					//创建链表
					pHead.InputStudent();
				}
				break;

				case 2://输出学生信息
				{
					//遍历链表
					pHead.OutputStudent();
				}
				break;

				case 3://增加学生信息
				{
					pHead.AddStudent();
					pHead.FileOutputStudent();
				}
				break;

				case 4://删除学生信息
				{
					pHead.DeleteStudent();
					pHead.FileOutputStudent();
				}
				break;

				case 5://修改学生信息
				{
					pHead.ChangeStudent();
					pHead.FileOutputStudent();
				}
				break;

				case 6://查找学生信息
				{
					pHead.SearchStudent();
				}
				break;


				case 7://对学生的成绩排序
				{
					pHead.SortScore();
					cout << "成绩排序后的结果:" << endl;
					pHead.SetScore();//设置排名
					pHead.OutputStudent();//打印排序后的结果
				}
				break;

				case 8://对学生的学号排序
				{
					pHead.SortNum();//学号排序
					cout << "学号排序后的结果:" << endl;
					pHead.SetScore();//设置排名
					pHead.OutputStudent();//打印排序后的结果
				}
				break;
				case 9://修改管理员信息
				{
					modify_admin();
				}
				break;
				default:
					break;
			}
			system("pause");
		}
	}
	else {
		while(true){
			//system("cls");
			cout << "=========================学生模式============================================\n\n";
			menu_stu();
			system("pause");
			cin>>select;
			cout << "===============================================================================\n\n";
			if(select == 0) {
				break;
			}
			switch (select) {
				case 1://输入学生信息
				{
					//创建链表
					pHead.InputStudent();
				}
				break;
				case 2://查找学生信息
				{
					pHead.SearchStudent();
				}
				break;


				case 3://对学生的成绩排序
				{
					pHead.SortScore();
					cout << "成绩排序后的结果:" << endl;
					pHead.SetScore();//设置排名
					pHead.OutputStudent();//打印排序后的结果
				}
				break;

				case 4://对学生的学号排序
				{
					pHead.SortNum();//学号排序
					cout << "学号排序后的结果:" << endl;
					pHead.SetScore();//设置排名
					pHead.OutputStudent();//打印排序后的结果
				}
				break;
				default:
					break;
			}
			system("pause");
		}
	}
	system("pause");
	return 0;
}

void menu_admin() {
	now = time (NULL);
	cout << "------------------------欢迎使用学生成绩管理系统----------------------------------\n\n";
    cout << "===============================================================================\n\n";
	cout << "------------------------请输入操作命令(首次操作需执行1命令)----------------------\n\n";
	cout << "-------------------------- 1 输入学生信息--------------------------------------\n\n";
	cout << "-------------------------- 2 输出学生信息--------------------------------------\n\n";
	cout << "-------------------------- 3 增加学生信息--------------------------------------\n\n";
	cout << "-------------------------- 4 删除学生信息--------------------------------------\n\n";
	cout << "-------------------------- 5 修改学生信息--------------------------------------\n\n";
	cout << "-------------------------- 6 查找学生信息--------------------------------------\n\n";
	cout << "-------------------------- 7 将学生的成绩按从大到小排--------------------------\n\n";
	cout << "-------------------------- 8 将学生的学号按从小到大排--------------------------\n\n";
	cout << "-------------------------- 9 修改管理员信息--------------------------\n\n";
	cout << "-------------------------- 0 退出系统-----------------------------------------\n\n";
	cout << "===============================================================================\n\n";
	cout << "Made by Zhou Yiguo,Zhao Yukuo,Yue Yaodaong,Now time is "<<ctime(&now)<<"\n\n";
}

void menu_stu() {
	now = time (NULL);
	cout << "------------------------ 欢迎使用学生成绩管理系统----------------------------------\n\n";
    cout << "===============================================================================\n\n";
	cout << "------------------------请输入操作命令(首次操作需执行1命令)----------------------\n\n";
	cout << "-------------------------- 1 输入学生信息--------------------------------------\n\n";
	cout << "-------------------------- 2 查找学生信息--------------------------------------\n\n";
	cout << "-------------------------- 3 将学生的成绩按从大到小排--------------------------\n\n";
	cout << "-------------------------- 4 将学生的学号按从小到大排--------------------------\n\n";
	cout << "-------------------------- 0 退出系统-----------------------------------------\n\n";
	cout << "===============================================================================\n\n";
	cout << "Made by Zhou Yiguo,Zhao Yukuo,Yue Yaodaong,Now time is "<<ctime(&now)<<"\n\n";
}

int menu_login() {
	FILE *fp1,*fp2;
	string state;
	char str1[str_max],str2[str_max],str_u[str_max],str_p[str_max];
	if((fp1=fopen("admin.txt","rb"))==NULL) {
		cout << "------------------------欢迎使用学生成绩管理系统----------------------------------\n\n";
		cout << "==========================================================================\n\n";
		cout << "------------------------创建管理员账号-----------------------------------\n\n";
		cout << "------------------------本系统无管理员，请创建！------------------------\n\n";
		now = time (NULL);
		cout << "Now time is "<<ctime(&now)<<"\n\n";
		cout << "==========================================================================\n\n";
		cout << "------------------------请输入管理员账号-----------------\n\n";
		cin >> str_u;
		cout << "------------------------请输入密码-----------------\n\n";
		cin >> str_p;
		cout << "------------------------创建密码中---------------------------------------\n\n";
		fp2 = fopen("admin.txt","wb");
		fprintf(fp2,"%s%c",str_u,'\n');
		fprintf(fp2,"%s%c",str_p,' ');
		fclose(fp2);
		cout << "------------------------已完成账号创建---------------------------------------\n\n";
		cout << "==========================================================================\n\n";
	}
	fp1 = fopen("admin.txt","rb");
	fscanf(fp1,"%s",str1);
	fscanf(fp1,"%s",str2);
	fclose(fp1);
	while(true) {
		system("cls");
		cout << "------------------------欢迎使用学生成绩管理系统----------------------------------\n\n";
		cout << "===============================================================================\n\n";
		cout << "------------------------登录方式----------------------------------------\n\n";
		cout << "------------------------ 1 管理员模式-------------------------------------\n\n";
		cout << "------------------------ 2 学生模式-----------------------------------\n\n";
		cout << "------------------------请你选择(1或2)-----------------------------------\n\n";
		cout << "===============================================================================\n\n";

		cin >> state;
		if(state == "2")
			return 0;
		else if(state == "1"){
			cout << "===============================================================================\n\n";
			cout << "------------------------请输入账号--------------------------------------\n\n";
			cin >> str_u ;
			cout << "------------------------请输入密码---------------------------------------\n\n";
			cin >> str_p ;
			cout << "===============================================================================\n\n";
			if(strcmp(str1,str_u)==0 && strcmp(str2,str_p)==0) {
				getchar();
				return 1;
			}
			else {
				cout << "===============================================================================\n\n";
				cout << "------------------------账号或密码错误!!!---------------------------------------\n\n";
				cout << "===============================================================================\n\n";
				system("pause");
				system("cls");
			}
		}
		else {
			cout << "===============================================================================\n\n";
			cout << "------------------------输入不合法!!!--------------------------------------\n\n";
			cout << "===============================================================================\n\n";
			system("pause");
			system("cls");
		}
	}
}

void modify_admin() {
	FILE *fp;
	char str_u[str_max],str_p[str_max];
	fp = fopen("admin.txt","wb");
	cout << "==========================================================================\n\n";
	cout << "------------------------请输入管理员账号-----------------\n\n";
	cin >> str_u;
	cout << "------------------------请输入密码-----------------\n\n";
	cin >> str_p;
	cout << "------------------------信息更新中---------------------------------------\n\n";
	fp = fopen("admin.txt","wb");
	fprintf(fp,"%s%c",str_u,'\n');
	fprintf(fp,"%s%c",str_p,' ');
	fclose(fp);
	cout << "------------------------管理员信息更新完毕---------------------------------------\n\n";
	cout << "==========================================================================\n\n";
	getchar();
}
